console.log(('number' + 3 + 3)); // 'number' + 3 = 'number3' + 3 = 'number33' -  конкатенація

console.log(null + 3); // null перетворюєтья в 0, тобто довання не зі string (числова операція) = 0+3=3

console.log(5 && "qwerty"); // && - оператор повертає НЕ true, 5 - number - true, тому відповідь qwerty

console.log(+'40'+ +'2' + "hillel");// +'40' = 40 - унарний плюс перетворює string на nuber, така ж історія з +'2' = 2, операція додавання 40+2=42, конкатенація 42+"hillel" = 42hillel

console.log('10' - 5 === 6); // унарний мінус перетворює string '10' в number, тому 10-5=5, а 5 === 6 - false / === - оператор суворої рівності

console.log(true + false); // true = 1 + false = 0 - 1+0=1

console.log('4px' - 3); // '4px' - неможливо перетворити в число, тому воно буде як NaN, NaN - 3 = Nan, операція віднімання - числова операція

console.log('4' - 3); // 4-3=1, string '4' перевторено в 4, тому числова операція віднімання відбувається

console.log('6' + 3 ** 0); // операція ** має вищий прорітет за операцію +, тому 3 ** 0 = 1, піднесення до степення. '6' + 1 = 61 - конкатенація

console.log(12/'6'); // / - числова операція, тому перетворення '6' = 6, 12/6=2

console.log('10' + (5 === 6)); // 5 === 6 - false / '10' + false - конкатенація

console.log(null == ''); // == робить автоприведення типів, тобто null == undefined - true, але при порівнянні null з '', null не можнпа перетворити в '', або навпаки, тому - false

console.log(3 ** (9 / 3)); // математичні обчислення, (9/3)=3, піднесення до степеню, 3 ** 3 = 27

console.log(!!'false' == !!'true'); // відповідь - true / !!'false' - не порожній рядок, !!'не порожній рядок', при порівнянні - true == true - true

